package org.one.day12;

/**
 * 1.4.1 证明从N个数中取三个整数的不同组合为N(N-1)(N-2)/6,提示：使用数学归纳法。
 *
 * @author cheng
 *         2018/1/2 18:37
 */
public class Example1 {
    /*
    数学归纳法:
        是一种数学证明方法，通常被用于证明某个给定命题在整个（或者局部）自然数范围内成立。
        除了自然数意外，广义上的数学归纳法也可以用于证明一般良机基结构，例如：集合论只能的树。
        这种广义的数学归纳法应用于数学逻辑和计算机科学领域，称作结构归纳法。
    证明流程：
        1.当证明当n=1时命题成立。
        2.假设n=m时命题成立，那么可以推导出在n=m+1时命题也成立。（m代表任意自然数）
          这种方法的原理在于：首先证明在某个起点值时命题成立，然后证明从一个值到下一个值的过程有效。
          当这两点都已经证明，那么任意值都可以通过反复使用这个方法推导出来。
          把这个方法想象成多米诺效应更容易理解。

     答案：
        当n=3 ，N(N-1)(N-2)/6=1成立
        当n=4 ，N(N-1)(N-2)/6=4成立
    * */
}









